content/posts/vim.md
+++
title = "Vim"
author = ["Jacob Chvatal"]
lastmod = 2020-10-14T20:45:23+02:00
slug = "vim"
draft = false
+++

### Backlinks {#backlinks}

-   [Tmux]({{< relref "tmux" >}})
-   [React]({{< relref "react" >}})

Vim is a text editor with an easily configurable extension language. It's most frequently used as a [TUI]({{< relref "terminal_ui" >}}) program but also has an (aft-used) graphical application distribution (Gvim).

I've come to prefer the power of [Emacs]({{< relref "emacs" >}}) but I do miss Vim's performance.

However, it has a first-class editor-based extension language that's written to prioritize text processing and configuration. Its extensive, literate keybindings that have made their way into every popular text editor as well as many other applications.

It's one of best text-editing tools in the Unix ecosystem, and Vim users often have a library of cli and tui programs that they use in conjunction with Vim to facilitate a desktop ecosystem without a GUI.

Vim is often preinstalled on Unix systems. If it's unavailable, such systems will likely still have vi (or busybox vi), so taking the time to learn vim keybindings is worthwhile for their flexibility throughout programming environments.


## Tools {#tools}

<https://github.com/glacambre/firenvim> neovim in the browser
<https://github.com/puremourning/vimspector> debugging system for vim
<https://www.reddit.com/r/vim/comments/i0lffn/thought%5Fid%5Fshare%5Fsome%5Frecent%5Fvimspector/>


## Resources {#resources}

<https://www.reddit.com/r/vim/comments/i1tfux/i%5Fhave%5Ffallen%5Fto%5Fvim/> learning more about vim mappings
<https://www.reddit.com/r/vim/comments/h8pgor/til%5Fconceal%5Fin%5Fvim/> -- concealing plaintext symbols with glyphs


## Plugins {#plugins}

<https://www.reddit.com/r/vim/comments/i1p3s9/fernvim%5Fa%5Fmodern%5Fasynchronous%5Ffile%5Fmanager%5Ffor%5Fvim/> async file manager, with lists of alternatives
<https://www.reddit.com/r/vim/comments/i0tciv/you%5Fliked%5Fso%5Fmuch%5Fthe%5Ffirst%5Fversion%5Fthat%5Fi/> a vim plugin for highlighting infomration in different colors while parsing a document
<https://www.reddit.com/r/vim/comments/hvr09s/how%5Fcan%5Fi%5Fintegrate%5Fa%5Fvim%5Ftext%5Feditor%5Fin%5Freact/> adding vim text editor to react project
<https://www.reddit.com/r/vim/comments/hxn5ue/how%5Fdo%5Fi%5Fuse%5Fmacros%5Fwhen%5Fi%5Fhave%5Fvariable%5Famount/> meta macros for variable amounts of data
<https://www.reddit.com/r/vim/comments/hwdehp/vim%5Fosc%5Flivecoding/> livecoding in vim
<https://www.reddit.com/r/vim/comments/hy3yma/what%5Fis%5Fthe%5Fbest%5Fleader%5Fkey/> finding the best leader key
<https://app.getpocket.com/read/3056881828> arbitrary variables in vimrcs
<https://github.com/mhinz/vim-signify> show a diff with vim sign column
<https://github.com/francoiscabrol/ranger.vim> rangerinteraction inside of vim
<https://github.com/huyvohcmc/atlas.vim> colorful vim theme?
